cases/openfoam.com/combustionChamber/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:                                        |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         20;

deltaT          0.000005;

writeControl    adjustableRunTime;

writeInterval   0.02;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep yes;

maxCo           3.5;

libs
(
    "libsolverFunctionObjects.so"
);

functions
{
    S
    {
        type            scalarTransport;
        writeInterval   outputTime;
        field           S;
        D               0;
        schemesField    S;
        nCorr           3;
        resetOnStartUp  false;
    }

    solverDiagnostic
    {
        type            solverInfo;
        fields          (p U k epsilon);

    }
}

// ************************************************************************* //
