cases/openfoam.com/combustionChamber/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:                                        |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inletCenter
    {
        type            zeroGradient;
    }
    inletLeftRight
    {
        type            zeroGradient;
    }
    inletMid
    {
        type            zeroGradient;
    }
    outlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    wallCenterInner
    {
        type            zeroGradient;
    }
    wallCenterOuter
    {
        type            zeroGradient;
    }
    wallDiffusor
    {
        type            zeroGradient;
    }
    wallInletSmall
    {
        type            zeroGradient;
    }
    wallSphere
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
