cases/openfoam.com/combustionChamber/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:                                        |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver           GAMG;
        tolerance        1e-7;
        relTol           0.01;
        smoother         GaussSeidel;
        nPreSweeps       0;
        nPostSweeps      2;
        cacheAgglomeration on;
        agglomerator     faceAreaPair;
        nCellsInCoarsestLevel 10;
        mergeLevels      1;
    }

    pFinal
    {
        $p;
        relTol 0;
    }

    U
    {
        solver           smoothSolver;
        smoother         GaussSeidel;
        tolerance        1e-8;
        relTol           0.1;
        nSweeps          1;
    }

    UFinal
    {
        $U;
        relTol 0;
    }

    k
    {
        solver           smoothSolver;
        smoother         GaussSeidel;
        tolerance        1e-8;
        relTol           0.1;
        nSweeps          1;
    }

    kFinal
    {
        $k;
        relTol 0;
    }

    epsilon 
    {
        solver           smoothSolver;
        smoother         GaussSeidel;
        tolerance        1e-8;
        relTol           0.1;
        nSweeps          1;
    }

    epsilonFinal
    {
        $epsilon;
        relTol 0;
    }

    S 
    {
        solver           smoothSolver;
        smoother         GaussSeidel;
        tolerance        1e-8;
        relTol           0.1;
        nSweeps          1;
    }

    S 
    {
        $epsilon;
        relTol 0;
    }
}


PIMPLE
{

    residualControl
    {
        p
        {
            relTol 0;
            tolerance 1e-4;
        }

        U
        {
            relTol 0;
            tolerance 1e-5;
        }
    }
}
PIMPLE
{
    //- Correct the fluxes based on mesh motion. See header files of the solver
    correctPhi          false;

    //- Turn on of off the momentum predictor. In a numerical point of view
    //  not necessary. Useful for 2-phase and high viscosity ratios
    momentumPredictor   true;

    //- Calculate the turbulence in each outer loop or only at the end of one
    //  time step calculation. High turbulent flow calculation should calculate
    //  the turbulence properties in each outer loop
    turbOnFinalIterOnly true;

    //- Use the SIMPLE(C) := C =  consistent / corrected algorithm for
    //  the outer corrections. A pressure term that is neglected in the
    //  SIMPLE algorithm is included. More inner calculations but the
    //  coupling U-p in general is solved faster
    consistent          false;

    //- Mesh non-orthogonality correctors. Foam handles non-orthogonality quite
    //  good, so there is no need to use or only up to 2 - 3
    nNonOrthogonalCorrectors 0;

    //- Outer loops, re-calculation around p-U and other equations within
    //  one time step. For stiff problems while using under-relaxation
    nOuterCorrectors    20;

    //- Pressure corrections
    nCorrectors         2;

    //- If the transient solution tends towards a steady state solution,
    //  end the calculation after the residual control is reached
    residualControl
    {
        p     { tolerance 1e-4; relTol 0; }
        U     { tolerance 1e-5; relTol 0; }
    }

    //- Control over each time step. The outer loops are recalculated
    //  till the residuals are reached. For outer loops, we can use
    //  under-relaxation as it is kind of a SIMPLE loop. Stiff problems
    //  can be handled and the time step can be increased. Further information
    //  are given in the book Mathematics, Numerics, Derivations and OpenFOAM

    //- This one is not available in ESI-OpenCFD, only in the cfdDirect 
    //  Foundation version
    /*
    outerCorrectorResidualControl
    {
        p    
        {
            relTol      0;
            tolerance   1e-4;
        }
        U    
        {
            relTol      0;
            tolerance   1e-5;
        }
    }
    */
}

//- Relaxation factors applied to the fields or equations in the outer loops
//  If nOuterCorrectors is not used, no underrelaxation should be placed.
//  Always use the *.Final factor too, only you really know what your are doing
//  ++ Relaxation of the final outer correction is possible, if the residual
//     controls are very strict.
relaxationFactors
{
    //- Relaxation of the fields: See doxygen
    //  Range [0-1] while 0 does not change the field (no sense)
    fields
    {
        p               0.4;
        pFinal            1;
    }
    //- Relaxation of the equation:
    //  Factor: -1 disables the usage
    //  Factor: 1 makes the matrix diagonal dominant or at least equal
    //          --> matrix might be manipulated
    //  Factor: 0 < alpha < 1; underrelaxation - make matrix diagonal dominat
    //  Factor: alpha > 1; over-relaxation - make matrix diagonal dominat weak
    //          --> can be used in some cases, generally not stable
    equations
    {
        S                         1;
        "(k|epsilon|U)"           0.6;
        "(k|epsilon|U)Final"      1;
    }
}

// ************************************************************************* //
